[
  {
    "id": "670fe84e-6e10-4b84-a5b0-af2828b22b3a",
    "title": "Senior Software Engineer",
    "company": "GEICO",
    "companyLogoImageUrl": "../../assets/images/companies/geico.png",
    "location": "Remote, CA, USA",
    "countryFlagImageUrl": "../../assets/images/flags/us.png",
    "skillIds": [
      "9d5e1112-60c9-40f3-a0ca-02a521342d85",
      "c2ae4aeb-48c8-405c-8407-09cc31c947cf",
      "280fc41e-cf77-4d1a-aac4-542e052b5eac",
      "5dc5d6ec-4bdc-43c7-b2c1-0431ef4e076f",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "3590eef7-19b9-4ea3-99d0-ecf14a27fb9b",
      "c8d4739d-e481-4516-bfec-ef65623ad902",
      "b6f47a46-1231-45cf-9a15-173fc66cdc20",
      "4f2831c8-1aac-43a1-ab5b-9e623fcf271a",
      "f43cba54-41e2-48e8-b584-00257f96bfec",
      "da373955-3ae1-4ebc-980a-997271bd7d17",
      "65b067c7-0016-4933-9b7e-dcbe81514ae1",
      "f9696ba5-8f1a-4f62-a342-e1be1ad9497b",
      "af365eb4-cda7-4fba-926c-e3c63c4bbb36",
      "5c593a35-9e2e-420a-a2c4-c7cf09cea3b2",
      "547bb631-a704-4bab-83b4-f10d9c76edc3"
    ],
    "taskPerformed": [
      "Spearheaded the development of the Rescoring system, reducing product time-to-market and positioning GEICO as a leader in the insurance industry.",
      "Developed a resilient, event-driven architecture on Microsoft Azure using AKS with auto-scaling, ensuring high availability, cost-efficiency, and outstanding performance.",
      "Streamlined data management by integrating with Snowflake for result ingestion and Cosmos DB for metadata storage, enhancing data reliability and accessibility.",
      "Implemented an intuitive user interface using React 18, and developed a RESTful .NET 6 web API backend, resulting in improved user experience and operational efficiency.",
      "Utilized Azure Service Bus and parallel chunk processing to create a highly efficient, event-driven application, significantly boosting operational throughput."
    ],
    "startDate": "2023-03-01"
  },
  {
    "id": "ac8d0e6b-05d9-405f-9959-a15851ea69d5",
    "title": "Lead Software Engineer",
    "company": "EPAM Systems",
    "companyLogoImageUrl": "../../assets/images/companies/epam-us.png",
    "location": "San Jose, CA, USA",
    "countryFlagImageUrl": "../../assets/images/flags/us.png",
    "skillIds": [
      "9d5e1112-60c9-40f3-a0ca-02a521342d85",
      "c2ae4aeb-48c8-405c-8407-09cc31c947cf",
      "280fc41e-cf77-4d1a-aac4-542e052b5eac",
      "6a4a375d-a175-42ae-8c28-6a5ad02344d6",
      "6d90cdd3-58b6-4242-8b7f-8c783a7041a7",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "e51a3857-56e6-4052-bbd4-947171f84dda",
      "01597c16-b140-4133-83da-966f276c0c11",
      "4f2831c8-1aac-43a1-ab5b-9e623fcf271a",
      "57250f1c-f500-4988-8eb7-c1b26f589132",
      "65b067c7-0016-4933-9b7e-dcbe81514ae1",
      "f9696ba5-8f1a-4f62-a342-e1be1ad9497b",
      "af365eb4-cda7-4fba-926c-e3c63c4bbb36",
      "3cf864dc-af87-471a-9009-f0f78195be1f",
      "547bb631-a704-4bab-83b4-f10d9c76edc3",
      "ad43f80f-71d5-47df-b721-f4ae13f85a2b"
    ],
    "taskPerformed": [
      "Led the migration and redesign of the Execution Compliance and Trade Surveillance System (ECS), transitioning from a monolithic structure to a set of Dockerized services hosted on AWS, resulting in enhanced scalability and system performance.",
      "Played a pivotal role in improving the overall design of ECS, developing new features, maintaining existing functionalities, and ensuring smooth client onboarding during the transition, all within a .NET 6 environment.",
      "Significantly improved the existing Vue.js-based web dashboard for the Execution Compliance and Trade Surveillance System (ECS), adding new features and functionalities to enhance user experience and operational insight.",
      "Implemented an event-driven workflow for ECS using Amazon SQS and AWS Lambda with Python, ensuring timely and precise data handling.",
      "Implemented surveillance mechanisms within ECS to identify and address fraudulent activities and manipulative behaviors, while ensuring adherence to best execution standards, safeguarding the firm's reputation and compliance stance."
    ],
    "startDate": "2021-10-01",
    "endDate": "2023-03-01"
  },
  {
    "id": "6439facb-1c42-4460-bb17-c0cb3d0d5803",
    "title": "Lead Software Engineer",
    "company": "EPAM Systems",
    "companyLogoImageUrl": "../../assets/images/companies/epam-poland.png",
    "location": "Wroclaw, Poland",
    "countryFlagImageUrl": "../../assets/images/flags/pl.png",
    "skillIds": [
      "f43cba54-41e2-48e8-b584-00257f96bfec",
      "c2ae4aeb-48c8-405c-8407-09cc31c947cf",
      "2f66b4c4-863a-40aa-8f11-18becb7da725",
      "d612e8d5-01f7-452d-9f8c-2f905cc13ef3",
      "d37d4816-a1e5-49fd-bfcb-47750241be14",
      "280fc41e-cf77-4d1a-aac4-542e052b5eac",
      "115a7340-5110-4dd6-921d-54ac651dbd16",
      "bd5af812-549b-4ce6-9679-669d5b5d3303",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "4c823607-d081-4561-bc5c-9c3ef09bdc0c",
      "4f2831c8-1aac-43a1-ab5b-9e623fcf271a",
      "5c593a35-9e2e-420a-a2c4-c7cf09cea3b2",
      "d68e1fc9-265a-497d-9820-d85254cdd8f4",
      "f9696ba5-8f1a-4f62-a342-e1be1ad9497b",
      "af365eb4-cda7-4fba-926c-e3c63c4bbb36",
      "3590eef7-19b9-4ea3-99d0-ecf14a27fb9b",
      "547bb631-a704-4bab-83b4-f10d9c76edc3",
      "ad43f80f-71d5-47df-b721-f4ae13f85a2b"
    ],
    "taskPerformed": [
      "Developed a cloud-native, microservice-based system for managing insurance claims, underwriting, and reporting in Azure, streamlining Elips Life Insurance's operations and enhancing their service delivery speed and reliability.",
      "Created a user-friendly self-service portal using Angular 13, complemented by RESTful Web APIs developed with .NET Core 6.0, significantly enhancing customer satisfaction and operational efficiency.",
      "Implemented performance-critical internal services with Golang and Gin web framework, ensuring efficient and reliable handling of insurance operations, and maintaining a competitive edge in the insurance market.",
      "Utilized cutting-edge technologies including Azure, .NET Core 6.0, and Golang, demonstrating Elips Life Insurance’s commitment to innovation and solidifying their position in the digital transformation of the insurance sector.",
      "Enhanced system security and user authentication with OKTA, ensuring that the insurance management system adheres to the highest standards of data security and privacy, and building trust with clients."
    ],
    "startDate": "2019-04-01",
    "endDate": "2021-10-01"
  },
  {
    "id": "a4ac9bf7-30ae-4ae9-af01-90b95e46818b",
    "title": "Senior Software Engineer",
    "company": "Credit Suisse",
    "companyLogoImageUrl": "../../assets/images/companies/credit-suisse.png",
    "location": "Wroclaw, Poland",
    "countryFlagImageUrl": "../../assets/images/flags/pl.png",
    "skillIds": [
      "b6f47a46-1231-45cf-9a15-173fc66cdc20",
      "2f66b4c4-863a-40aa-8f11-18becb7da725",
      "612f0b9e-23d3-45f7-9425-26e5d1d36428",
      "7efceebd-cc5c-437b-8230-5819d954aa80",
      "393d2750-f2df-41d5-b0e4-6ab9fc71487e",
      "c6c8d228-f485-45af-896d-73acb0f7790a",
      "6d90cdd3-58b6-4242-8b7f-8c783a7041a7",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "4f2831c8-1aac-43a1-ab5b-9e623fcf271a",
      "4576cdf1-6cc3-432c-911d-a03003bac8bc",
      "cf3878a7-9c27-4a4e-9c69-bbd1c0f5c811",
      "502ca177-2510-4147-8db8-cc79f47d6ebf",
      "3cf864dc-af87-471a-9009-f0f78195be1f",
      "ad43f80f-71d5-47df-b721-f4ae13f85a2b"
    ],
    "taskPerformed": [
      "Engineered a robust desktop application for Credit Suisse’s front office using WPF and C#, significantly enhancing the team’s ability to manage market risks in real time and contributing to more informed and timely decision-making processes.",
      "Successfully transitioned from a monolithic architecture to a microservices-oriented design, resulting in enhanced system flexibility, scalability, and a notable improvement in performance, thereby supporting the company’s growth and efficiency goals.",
      "Implemented comprehensive automated testing procedures, substantially reducing the occurrence of bugs and errors, and consequently increasing the reliability and stability of critical financial systems.",
      "Conducted in-depth optimization of the in-house distributed cache using C#, achieving faster processing times and improved efficiency, which directly contributed to smoother and more responsive user experiences.",
      "Utilized extensive knowledge of MS SQL and MS SSAS to manage, analyze, and optimize data storage and retrieval processes, driving data-driven decision-making and operational excellence within the organization."
    ],
    "startDate": "2015-08-01",
    "endDate": "2019-03-01"
  },
  {
    "id": "85c948f1-872d-4b47-9466-d09d5c1a9496",
    "title": "Senior Software Engineer",
    "company": "Yandex",
    "companyLogoImageUrl": "../../assets/images/companies/yandex.png",
    "location": "Moscow, Russia",
    "countryFlagImageUrl": "../../assets/images/flags/ru.png",
    "skillIds": [
      "b6f47a46-1231-45cf-9a15-173fc66cdc20",
      "71925c87-06d5-47e1-9ceb-1e007b75f7e9",
      "280fc41e-cf77-4d1a-aac4-542e052b5eac",
      "393d2750-f2df-41d5-b0e4-6ab9fc71487e",
      "c6c8d228-f485-45af-896d-73acb0f7790a",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "4576cdf1-6cc3-432c-911d-a03003bac8bc",
      "cf3878a7-9c27-4a4e-9c69-bbd1c0f5c811",
      "506bfc11-061a-49ae-b657-c1e1004fcca9",
      "502ca177-2510-4147-8db8-cc79f47d6ebf",
      "f9696ba5-8f1a-4f62-a342-e1be1ad9497b",
      "af365eb4-cda7-4fba-926c-e3c63c4bbb36",
      "3cf864dc-af87-471a-9009-f0f78195be1f",
      "ad43f80f-71d5-47df-b721-f4ae13f85a2b"
    ],
    "taskPerformed": [
      "Designed and implemented an innovative payment system for Yandex’s eDoc product, significantly streamlining the process for employees to pay for lunch at local cafes and restaurants using their cards, which enhanced efficiency and user convenience.",
      "Developed an intuitive and accessible personal page feature for employees, enabling them to easily track their transaction history and account balances, thereby fostering transparency and trust in the system.",
      "Created a desktop application tailored for administrators, simplifying the complexities of managing employee accounts and generating comprehensive reports, which resulted in improved operational efficiency.",
      "Played a key role in integrating eDoc with a variety of service providers, ensuring a seamless experience for employees accessing corporate benefits, while maintaining a single contract and control scheme for the organization.",
      "Developed tools and features that empowered HR managers to efficiently manage employee cards, set spending limits, and access expenditure reports, contributing to better financial management and oversight."
    ],
    "startDate": "2014-08-01",
    "endDate": "2015-08-01"
  },
  {
    "id": "af1e99ea-6383-4e5e-909a-947753cd2bfc",
    "title": "Software Engineer",
    "company": "Gollard",
    "companyLogoImageUrl": "../../assets/images/companies/gollard.png",
    "location": "Moscow, Russia",
    "countryFlagImageUrl": "../../assets/images/flags/ru.png",
    "skillIds": [
      "b6f47a46-1231-45cf-9a15-173fc66cdc20",
      "612f0b9e-23d3-45f7-9425-26e5d1d36428",
      "3095b2c3-72f8-4ffc-b735-54ae4cb0f7bc",
      "c6c8d228-f485-45af-896d-73acb0f7790a",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "01597c16-b140-4133-83da-966f276c0c11",
      "4576cdf1-6cc3-432c-911d-a03003bac8bc",
      "cf3878a7-9c27-4a4e-9c69-bbd1c0f5c811",
      "506bfc11-061a-49ae-b657-c1e1004fcca9",
      "502ca177-2510-4147-8db8-cc79f47d6ebf",
      "3cf864dc-af87-471a-9009-f0f78195be1f",
      "ad43f80f-71d5-47df-b721-f4ae13f85a2b"
    ],
    "taskPerformed": [
      "Spearheaded the development of a GIS desktop application using WPF for a leading energy distribution company, significantly enhancing the visualization and management of grids, stations, and facilities, which in turn boosted operational efficiency and improved decision-making accuracy.",
      "Implemented a real-time tracking feature for service transport, enabling the monitoring of both location and engine state, and bolstering the company's logistical capabilities and efficiency in resource allocation.",
      "Developed an advanced alerting system that leverages biometric camera data and sensor events, considerably enhancing the company’s security measures and readiness to respond to incidents.",
      "Played a pivotal role in the development of the GIS FSK application for a major grid management entity, efficiently managing large volumes of data with multithreading approaches to maintain a responsive user interface and ensure a smoother operational workflow.",
      "Actively contributed to the creation of the “Safe City” security solution using WPF, improving the safety of buildings and areas through the integration of live and archived video streams, as well as the management of sensor events, thereby strengthening the overall security infrastructure."
    ],
    "startDate": "2013-06-01",
    "endDate": "2014-07-01"
  },
  {
    "id": "f248d143-172f-4c6f-a41f-e242a2adb4eb",
    "title": "Software Engineer",
    "company": "SGC",
    "companyLogoImageUrl": "../../assets/images/companies/sgc.png",
    "location": "Moscow, Russia",
    "countryFlagImageUrl": "../../assets/images/flags/ru.png",
    "skillIds": [
      "b6f47a46-1231-45cf-9a15-173fc66cdc20",
      "c6c8d228-f485-45af-896d-73acb0f7790a",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "cf3878a7-9c27-4a4e-9c69-bbd1c0f5c811",
      "502ca177-2510-4147-8db8-cc79f47d6ebf",
      "e40f9138-42b4-4b98-ac28-fccd3b737252"
    ],
    "taskPerformed": [
      "Developed a comprehensive software tool for composing accurate construction cost estimates at SGC, resulting in a 25% reduction in preparation time and significantly streamlining the estimation process.",
      "Enhanced software flexibility by introducing a feature to convert estimates from other well-known systems, saving valuable time for users and promoting interoperability within the industry.",
      "Streamlined the report creation process by enabling the export of final estimate results to various formats, offering users customizable options and improving user satisfaction.",
      "Identified and implemented strategic software improvements at SGC, optimizing the workflow for estimate preparation and contributing to a more efficient project planning process.",
      "Focused on user needs to enhance the functionality and usability of the construction cost estimation software, fostering a positive user experience and reinforcing SGC's commitment to client satisfaction."
    ],
    "startDate": "2012-07-01",
    "endDate": "2013-06-01"
  },
  {
    "id": "0286b7fa-35dd-403d-96ec-3645e3551b3f",
    "title": "Software Engineer",
    "company": "R&D Center \"Start\"",
    "companyLogoImageUrl": "../../assets/images/companies/rosatom.png",
    "location": "Penza, Russia",
    "countryFlagImageUrl": "../../assets/images/flags/ru.png",
    "skillIds": [
      "b6f47a46-1231-45cf-9a15-173fc66cdc20",
      "178f585d-0107-4db5-a0de-8ed87ea44edd",
      "2aff5429-7459-4645-9299-92f85ed504f4",
      "cf3878a7-9c27-4a4e-9c69-bbd1c0f5c811"
    ],
    "taskPerformed": [
      "Successfully developed a comprehensive in-house CAD tool tailored for microboard design, including functionality to import AutoCAD files, which significantly enhanced the design team’s capability and efficiency.",
      "Implemented a vital feature allowing for the direct printing of photomasks for microboards using specialized equipment, streamlining the production process and ensuring precision in manufacturing.",
      "Optimized the performance of the CAD tool, achieving a 30% reduction in microboard design time, which resulted in faster project turnaround and increased productivity for the design team.",
      "Developed an intuitive user interface for the CAD tool, ensuring ease of use and quick adoption by the design team, which contributed to a smoother workflow and improved user satisfaction.",
      "Implemented advanced design features and tools within the CAD application, significantly improving the accuracy and precision of microboard designs, and reducing the margin of error in production."
    ],
    "startDate": "2010-08-01",
    "endDate": "2012-06-01"
  }
]
